/*  캘린더 라이브러리
    =========================================================
    npm i react-native-calendars
    =========================================================
*/

/*


캘린더 기본 포멧
====================================
import React from "react";
import { Calendar } from "react-native-calendars";
import { StyleSheet } from "react-native";

function CalendarView() {
  return (
    <Calendar style={styles.calendar} />
  );
}

const styles = StyleSheet.create({
  calendar: {
    borderBottomWidth: 1,
    borderBottomColor: '#e0e0e0',
  }
});

export default CalendarView;
=====================================
*/


/* 
    format() : js 내장 함수로 문자열
    문자열 포매팅은 공통 문자열 안에 치환자를 사용해서 원하는 변수 값으로 갈아 끼워서 원하는 최종 문자열을 만드는 것을 말합니다. 따라서 템플릿으로 사용하는 문자열 안에 변수의 역할을 하는 치환자를 끼워넣어 공통 문자열을 정의하고, 문자열 포매팅 메서드는 변수로 받은 파라메터 값들을 템플릿 문자열의 치환자 사용파라메터로 대입해서 변수처럼 적용할 치환자를 가장 단순한 방식의 문자열 포맷 메서드는 다음과 같이 정의합니다.
*/

/*
    드롭바 라이브러리1

    설치명령어
    ==============================================================================
        $ npm install react-native-dropdown-select-list
    ==============================================================================


    ==============================================================================
      npm install @react-navigation/native-stack
    ==============================================================================

    ==============================================================================
      npm install @react-navigation/native
    ==============================================================================

    
    드롭바 라이브러리1
*/